# CannotCreateCornerBalusters Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotCreateCornerBalusters Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't create corner Baluster
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateCornerBalusters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateCornerBalusters As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateCornerBalusters {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace